Revit 2024 API
ParameterTypeId.GridEndSegmentsLength Property
 "End Segments Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId GridEndSegmentsLength { get; }
Visual Basic
Public Shared ReadOnly Property GridEndSegmentsLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ GridEndSegmentsLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace